AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОформлениюИзлишковНедостач</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОформлениюАктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюОрдеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОрдерНаОтражениеРезультатовПересчетовТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОрдерНаОтражениеНедостачТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Я_ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПостановкиНаБалансЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПриПриемкеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОрдерНаОтражениеИзлишковТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура очищает помещение из записей по ресурсу "КОформлениюАктов".
//
Процедура ОчиститьПомещениеТоварыКОформлениюАктов() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОформлениюИзлишковНедостач.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТаблицаРегистраторов
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлениюИзлишковНедостач
	|ГДЕ
	|	ТоварыКОформлениюИзлишковНедостач.Помещение <> ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|	И ТоварыКОформлениюИзлишковНедостач.КОформлениюАктов <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлениюИзлишковНедостач.Период,
	|	ТоварыКОформлениюИзлишковНедостач.Регистратор,
	|	ТоварыКОформлениюИзлишковНедостач.Активность,
	|	ТоварыКОформлениюИзлишковНедостач.ВидДвижения,
	|	ТоварыКОформлениюИзлишковНедостач.ДокументОснование,
	|	ТоварыКОформлениюИзлишковНедостач.Склад,
	|	ТоварыКОформлениюИзлишковНедостач.Помещение,
	|	ТоварыКОформлениюИзлишковНедостач.Номенклатура,
	|	ТоварыКОформлениюИзлишковНедостач.Характеристика,
	|	ТоварыКОформлениюИзлишковНедостач.Серия,
	|	ТоварыКОформлениюИзлишковНедостач.КОформлениюАктов,
	|	ТоварыКОформлениюИзлишковНедостач.КОформлениюОрдеров
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлениюИзлишковНедостач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРегистраторов КАК ТаблицаРегистраторов
	|		ПО ТоварыКОформлениюИзлишковНедостач.Регистратор = ТаблицаРегистраторов.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыКОформлениюИзлишковНедостач.НомерСтроки
	|ИТОГИ ПО
	|	ТоварыКОформлениюИзлишковНедостач.Регистратор
	|");
	
	ВыборкаПоРегистраторам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоРегистраторам.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.ТоварыКОформлениюИзлишковНедостач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаПоРегистраторам.Регистратор);
		
		ВыборкаПоЗаписям = ВыборкаПоРегистраторам.Выбрать();
		Пока ВыборкаПоЗаписям.Следующий() Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			Если ВыборкаПоЗаписям.КОформлениюАктов <> 0 Тогда
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаПоЗаписям, , "Помещение, КОформлениюОрдеров");
				
				Если ВыборкаПоЗаписям.КОформлениюОрдеров <> 0 Тогда
					ДополнительнаяЗапись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ДополнительнаяЗапись, ВыборкаПоЗаписям, , "КОформлениюАктов");
				КонецЕсли;
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаПоЗаписям);
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад.Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти
